Applying ** staging **:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ecs_service.api will be created
+   resource "aws_ecs_service" "api" {
+       cluster                            = "demo-ecs-staging-cluster"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "demo-ecs-staging-api"
+       platform_version                   = "1.4.0"
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = "demo-ecs-staging-api"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = [
+               "sg-09d4edbd8c7bf43a9",
            ]
+           subnets          = [
+               "subnet-0353ba78126bdd1c9",
+               "subnet-0982f60a751845d13",
            ]
        }
    }

  # aws_ecs_task_definition.api will be created
+   resource "aws_ecs_task_definition" "api" {
+       arn                      = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   environment       = [
+                       {
+                           name  = "ALLOWED_HOSTS"
+                           value = "*"
                        },
+                       {
+                           name  = "DB_HOST"
+                           value = "demo-ecs-staging-db.cz32byfnfty0.eu-west-1.rds.amazonaws.com"
                        },
+                       {
+                           name  = "DB_NAME"
+                           value = "demoecs"
                        },
+                       {
+                           name  = "DB_PASS"
+                           value = "changeme123"
                        },
+                       {
+                           name  = "DB_USER"
+                           value = "demoecsapp"
                        },
+                       {
+                           name  = "DJANGO_SECRET_KEY"
+                           value = "changeme"
                        },
                    ]
+                   essential         = true
+                   image             = "167259143853.dkr.ecr.eu-west-1.amazonaws.com/recipe-app-api-devops:latest"
+                   logConfiguration  = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "demo-ecs-staging-api"
+                           awslogs-region        = "eu-west-1"
+                           awslogs-stream-prefix = "api"
                        }
                    }
+                   memoryReservation = 256
+                   mountPoints       = [
+                       {
+                           containerPath = "/vol/web"
+                           readOnly      = false
+                           sourceVolume  = "static"
                        },
                    ]
+                   name              = "api"
+                   portMappings      = [
+                       {
+                           containerPort = 9000
+                           hostPort      = 9000
                        },
                    ]
                },
+               {
+                   environment       = [
+                       {
+                           name  = "APP_HOST"
+                           value = "127.0.0.1"
                        },
+                       {
+                           name  = "APP_PORT"
+                           value = "9000"
                        },
+                       {
+                           name  = "LISTEN_PORT"
+                           value = "8000"
                        },
                    ]
+                   essential         = true
+                   image             = "167259143853.dkr.ecr.eu-west-1.amazonaws.com/recipe-app-api-proxy:latest"
+                   logConfiguration  = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "demo-ecs-staging-api"
+                           awslogs-region        = "eu-west-1"
+                           awslogs-stream-prefix = "proxy"
                        }
                    }
+                   memoryReservation = 256
+                   mountPoints       = [
+                       {
+                           containerPath = "/vol/static"
+                           readOnly      = true
+                           sourceVolume  = "static"
                        },
                    ]
+                   name              = "proxy"
+                   portMappings      = [
+                       {
+                           containerPort = 8000
+                           hostPort      = 8000
                        },
                    ]
                },
            ]
        )
+       cpu                      = "256"
+       execution_role_arn       = "arn:aws:iam::167259143853:role/demo-ecs-staging-task-exec-role"
+       family                   = "demo-ecs-staging-api"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                 = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       task_role_arn            = "arn:aws:iam::167259143853:role/demo-ecs-staging-api-task"

+       volume {
+           name = "static"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

```
Acquiring state lock. This may take a few moments...
aws_ecs_task_definition.api: Creating...
aws_ecs_task_definition.api: Creation complete after 0s [id=demo-ecs-staging-api]
aws_ecs_service.api: Creating...
aws_ecs_service.api: Creation complete after 1s [id=arn:aws:ecs:eu-west-1:167259143853:service/demo-ecs-staging-cluster/demo-ecs-staging-api]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

bastion_host = "ec2-34-248-209-119.eu-west-1.compute.amazonaws.com"
db_host = "demo-ecs-staging-db.cz32byfnfty0.eu-west-1.rds.amazonaws.com"

```